function [ colorpan ] = ColorPanSet( setNO )
%关于绘图配色的设置
% 定义色盘矩阵
% 关于颜色设置
% 颜色	RGB 三元组
% 黄色	[1 1 0]
% 品红色  [1 0 1]
% 青蓝色  [0 1 1]
% 红色    [1 0 0]
% 绿色	[0 1 0]
% 蓝色	[0 0 1]
% 白色	[1 1 1]
% 黑色	[0 0 0]


%% 定义色盘矩阵
colorpan=[1 1 1]; %初始设置一切为0时，显示白色
% 关于颜色设置
% 颜色	RGB 三元组
% 黄色	[1 1 0]
% 品红色  [1 0 1]
% 青蓝色  [0 1 1]
% 红色    [1 0 0]
% 绿色	[0 1 0]
% 蓝色	[0 0 1]
% 白色	[1 1 1]
% 黑色	[0 0 0]
%% 位置a1到a2变化b1到b2的总公式
% 1.从高到底
% b1/255-(b1-b2)/255*((k-(a1-1))/((a2-1)-(a1-1)))
% 2.从低到高
% (b2-b1)/255*((k-(a1-1))/((a2-1)-(a1-1)))

switch setNO
    %% 纯色设置
    case 0
        % 设置0，从白到蓝到深蓝（[1 1 1]~[0 0 1]）
        for k=1:1:100
            colorpan=[colorpan;1-0.01*k 1-0.01*k 1];
        end
    case 1
        % 设置1，从白到青蓝到蓝到深蓝
        % 白：位置1，颜色[1 1 1]
        % 青蓝：位置30，颜色[0 1 1]
        % 蓝：位置80，颜色[0 0 1]
        % 深蓝：位置100，颜色[20/255 43/255 140/255](RGB=[20 43 140])
        for k=1:1:99
            if k<30
                colorpan=[colorpan;1-(k/29),1,1];
            elseif k>=30 && k<80
                colorpan=[colorpan;0,1-((k-29)/(79-29)),1];
            else
                colorpan=[colorpan;(20/255)*((k-79)/(100-79)),(43/255)*((k-79)/(100-79)),1-(140/255)*((k-79)/(100-79))];
            end
        end
        
    case 2
        % 设置2，从白到粉红到红到深红
        % 白：位置1，颜色[1 1 1]
        % 粉红：位置20，颜色[1 153/255 200/255](RGB=[20 43 140])
        % 红：位置50，颜色[1 0 0]
        % 深红：位置100，颜色[50/255 0 0]（结束）
        for k=1:1:99
            if k<20
                colorpan=[colorpan;1,1-((255-153)/255)*(k/19),1-((255-200)/255)*(k/19)];
            elseif k>=20 && k<50
                colorpan=[colorpan;1,(153/255)*(1-(k-19)/(49-19)),(200/255)*(1-(k-19)/(49-19))];
            else
                colorpan=[colorpan;1-(255-50)/255*(k-49)/(100-49),0,0];
            end
        end
        
    case 3
        % 设置3，从白到黄到橘红
        % 白：位置1，颜色[1 1 1]
        % 黄：位置30，颜色[1 1 0]
        % 浅橘红：位置70，颜色[217/255  83/255  25/255](RGB=[217 83 25])
        % 深橘红：位置100，颜色[153/255  51/255 0](RGB=[153 51 0])（结束）
        for k=1:1:99
            if k<30
                colorpan=[colorpan;1,1,1-(k/29)];
            elseif k>=30 && k<70
                colorpan=[colorpan;1-(255-217)/255*((k-29)/(69-29)),1-(255-83)/255*((k-29)/(69-29)), (25/255)*((k-29)/(69-29))];
            else
                colorpan=[colorpan;217/255-(217-153)/255*((k-69)/(100-69)),83/255-(83-51)/255*((k-69)/(100-69)),25/255-(25/255)*((k-69)/(100-69))];
            end
        end
        
    case 4
        % 设置4，从白到浅绿到绿到深绿
        % 白：位置1，颜色[1 1 1]
        % 绿：位置20，颜色RGB=[119 172 48]
        % 次深绿：位置70，颜色RGB=[27 64 37]
        % 深绿：位置100，颜色RGB=[18 54 36]（结束）
        for k=1:1:99
            if k<20
                colorpan=[colorpan;1-(255-119)/255*k/19,1-(255-172)/255*k/19,1-(255-48)/255*k/19];
            elseif k>=20 && k<70
                colorpan=[colorpan;119/255-(119-27)/255*((k-19)/(69-19)),172/255-(172-64)/255*((k-19)/(69-19)), 48/255-(48-37)/255*((k-19)/(69-19))];
            else
                colorpan=[colorpan;27/255-(27-18)/255*((k-69)/(100-69)),64/255-(64-54)/255*((k-69)/(100-69)),37/255-(37-36)/255*((k-69)/(100-69))];
            end
        end
        
        
        %% 渐变色设置
    case 5
        % 设置5，由标准色jet修改而来从白到蓝到黄到红（[1 1 1]～[0 0 1]～[1 1 0]～[1 0 0])
        % 白：位置1，颜色[1 1 1]
        % 青蓝：位置20，颜色[0 1 1]
        % 黄：位置60，颜色[1 1 0]
        % 红：位置90，颜色[1 0 0]
        % 深红：位置100，颜色[132/255 0 0](RGB=[132 0 0])
        for k=1:1:99
            if k<20
                colorpan=[colorpan;1-(k/19),1,1];
            elseif k>=20 && k<60
                colorpan=[colorpan;(k-19)/(59-19),1,1-((k-19)/(59-19))];
            elseif k>=60 && k<90
                colorpan=[colorpan;1,1-((k-59)/(89-59)),0];
            else
                colorpan=[colorpan;1-(132/255)*((k-89)/(100-89)),0,0];
            end
        end
        
    case 6
        % 设置6，由标准色jet修改而来从白到浅蓝到蓝到青蓝到黄到红到深红
        % 白：位置1，颜色[1 1 1]
        % 浅蓝：位置15，颜色[173/255 235/255 1](RGB=[173 235 255])
        % 蓝：位置40，颜色[0 0 1]
        % 青蓝：位置55，颜色[0 1 1]
        % 黄：位置70，颜色[1 1 0]
        % 红：位置90，颜色[1 0 0]
        % 深红：位置100，颜色[132/255 0 0](RGB=[132 0 0])
        for k=1:1:99
            if k<15
                colorpan=[colorpan;1-((255-173)/255)*(k/14),1-((255-235)/255)*(k/14),1];  % 浅蓝：位置15，颜色[173/255 235/255 1](RGB=[173 235 255])
            elseif k>=15 && k<40
                colorpan=[colorpan;173/255*(1-(k-14)/(39-14)),235/255*(1-(k-14)/(39-14)),1]; % 蓝：位置40，颜色[0 0 1]
            elseif k>=40 && k<55
                colorpan=[colorpan;0,(k-39)/(54-39),1]; % 青蓝：位置55，颜色[0 1 1]
            elseif k>=55 && k<70
                colorpan=[colorpan;(k-54)/(69-54),1,1-((k-54)/(69-54))]; % 黄：位置70，颜色[1 1 0]
            elseif k>=70 && k<90
                colorpan=[colorpan;1,1-((k-69)/(89-69)),0]; % 红：位置90，颜色[1 0 0]
            else
                colorpan=[colorpan;1-(132/255)*((k-89)/(100-89)),0,0]; % 深红：位置100，颜色[132/255 0 0](RGB=[132 0 0])
            end
        end

end
end

